### Pandas

Pandas is a Python library used for working with data sets. It has functions for analyzing, cleaning, exploring, and manipulating data.

In [2]:
## let's first import pandas 

import pandas as pd
import numpy as np

### Dataframes

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [8]:
## playing with dataframe

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['column1','column2','column3','column4'])

In [5]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [9]:
df.to_csv('test')

In [10]:
## Accessing the elements
## There are two ways 1.loc and 2.iloc

df.loc['Row1']

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int32

In [11]:
type(df.loc['Row1'])

pandas.core.series.Series

** Note: series is when we have either only one row or one column

In [12]:
df.iloc[:,:]

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [13]:
df.iloc[2:,2:]

      column3  column4
Row3       10       11
Row4       14       15
Row5       18       19

In [14]:
type(df.iloc[2:,2:])

pandas.core.frame.DataFrame

In [15]:
## converting dataframes into array

df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [16]:
df.iloc[:,:].values.shape

(5, 4)

In [17]:
## check the null values in dataframes

df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

** No Null Vales

In [18]:
df

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [23]:
## count the number of values

df['column1'].value_counts()

column1
0     1
4     1
8     1
12    1
16    1
Name: count, dtype: int64

In [24]:
## To see only unique values

df['column1'].unique()

array([ 0,  4,  8, 12, 16])

In [26]:
df[['column1','column3']]

      column1  column3
Row1        0        2
Row2        4        6
Row3        8       10
Row4       12       14
Row5       16       18